OpenAtomFoundation/TobudOS/board/NUCLEO_STM32F446RE/TOS_CONFIG/tos_config.h
#ifndef _TOS_CONFIG_H_
#define  _TOS_CONFIG_H_

#include "stm32f4xx.h"	// ???????,??????????

#define TOS_CFG_TASK_PRIO_MAX           10u 	// ??TencentOS tiny????????????

#define TOS_CFG_ROUND_ROBIN_EN          0u		// ??TencentOS tiny????????????

#define TOS_CFG_OBJECT_VERIFY_EN           1u	// ??TencentOS tiny????????

#define TOS_CFG_TASK_DYNAMIC_CREATE_EN  1u		// TencentOS tiny ?????????

#define TOS_CFG_EVENT_EN                1u		// TencentOS tiny ???????

#define TOS_CFG_MMBLK_EN                1u		//??TencentOS tiny???????????

#define TOS_CFG_MMHEAP_EN               1u		//??TencentOS tiny??????????

#define TOS_CFG_MMHEAP_DEFAULT_POOL_EN  1u		// TencentOS tiny ??????????

#define TOS_CFG_MMHEAP_DEFAULT_POOL_SIZE        0x100	// ??TencentOS tiny?????????

#define TOS_CFG_MUTEX_EN                1u		// ??TencentOS tiny?????????

#define TOS_CFG_MESSAGE_QUEUE_EN        1u		// ??TencentOS tiny??????????

#define TOS_CFG_MAIL_QUEUE_EN           1u		// ??TencentOS tiny??????????

#define TOS_CFG_PRIORITY_MESSAGE_QUEUE_EN	1u	// ??TencentOS tiny?????????????

#define TOS_CFG_PRIORITY_MAIL_QUEUE_EN	1u		// ??TencentOS tiny?????????????

#define TOS_CFG_TIMER_EN                1u		// ??TencentOS tiny???????????

#define TOS_CFG_PWR_MGR_EN              0u		// ??TencentOS tiny????????????

#define TOS_CFG_TICKLESS_EN             0u		// ??Tickless ???????

#define TOS_CFG_SEM_EN                  1u		// ??TencentOS tiny?????????

#define TOS_CFG_TASK_STACK_DRAUGHT_DEPTH_DETACT_EN      1u	// ??TencentOS tiny???????????

#define TOS_CFG_FAULT_BACKTRACE_EN      0u		// ??TencentOS tiny???????????

#define TOS_CFG_IDLE_TASK_STK_SIZE      128u	// ??TencentOS tiny???????

#define TOS_CFG_CPU_TICK_PER_SECOND     1000u	// ??TencentOS tiny?tick??

#define TOS_CFG_CPU_CLOCK               (SystemCoreClock)	// ??TencentOS tiny CPU??

#define TOS_CFG_TIMER_AS_PROC           1u		// ?????TIMER???????

#endif
